RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_qeov2_regs.h
/*
 * WAVE0_HIGH_AREA0_LIMIT (RW)
 *
 * wave0 high area0 limit mode.
 * 0: output all bits are 1.
 * 1: output as level_max_limit0.level0_max_limit
 */
#define QEOV2_WAVE_MODE_WAVE0_HIGH_AREA0_LIMIT_MASK (0x1000U)
#define QEOV2_WAVE_MODE_WAVE0_HIGH_AREA0_LIMIT_SHIFT (12U)
#define QEOV2_WAVE_MODE_WAVE0_HIGH_AREA0_LIMIT_SET(x) (((uint32_t)(x) << QEOV2_WAVE_MODE_WAVE0_HIGH_AREA0_LIMIT_SHIFT) & QEOV2_WAVE_MODE_WAVE0_HIGH_AREA0_LIMIT_MASK)
#define QEOV2_WAVE_MODE_WAVE0_HIGH_AREA0_LIMIT_GET(x) (((uint32_t)(x) & QEOV2_WAVE_MODE_WAVE0_HIGH_AREA0_LIMIT_MASK) >> QEOV2_WAVE_MODE_WAVE0_HIGH_AREA0_LIMIT_SHIFT)

/*
 * WAVE0_LOW_AREA1_LIMIT (RW)
 *
 * wave0 low area1 limit mode.
 * 0: output 0.
 * 1: output as level_min_limit0.level1_min_limit
 */
#define QEOV2_WAVE_MODE_WAVE0_LOW_AREA1_LIMIT_MASK (0x800U)
#define QEOV2_WAVE_MODE_WAVE0_LOW_AREA1_LIMIT_SHIFT (11U)
#define QEOV2_WAVE_MODE_WAVE0_LOW_AREA1_LIMIT_SET(x) (((uint32_t)(x) << QEOV2_WAVE_MODE_WAVE0_LOW_AREA1_LIMIT_SHIFT) & QEOV2_WAVE_MODE_WAVE0_LOW_AREA1_LIMIT_MASK)
#define QEOV2_WAVE_MODE_WAVE0_LOW_AREA1_LIMIT_GET(x) (((uint32_t)(x) & QEOV2_WAVE_MODE_WAVE0_LOW_AREA1_LIMIT_MASK) >> QEOV2_WAVE_MODE_WAVE0_LOW_AREA1_LIMIT_SHIFT)

/*
 * WAVE0_LOW_AREA0_LIMIT (RW)
 *
 * wave0 low area0 limit mode.
 * 0: output 0.
 * 1: output as level_min_limit0.level1_min_limit
 */
#define QEOV2_WAVE_MODE_WAVE0_LOW_AREA0_LIMIT_MASK (0x400U)
#define QEOV2_WAVE_MODE_WAVE0_LOW_AREA0_LIMIT_SHIFT (10U)
#define QEOV2_WAVE_MODE_WAVE0_LOW_AREA0_LIMIT_SET(x) (((uint32_t)(x) << QEOV2_WAVE_MODE_WAVE0_LOW_AREA0_LIMIT_SHIFT) & QEOV2_WAVE_MODE_WAVE0_LOW_AREA0_LIMIT_MASK)
#define QEOV2_WAVE_MODE_WAVE0_LOW_AREA0_LIMIT_GET(x) (((uint32_t)(x) & QEOV2_WAVE_MODE_WAVE0_LOW_AREA0_LIMIT_MASK) >> QEOV2_WAVE_MODE_WAVE0_LOW_AREA0_LIMIT_SHIFT)

/*
 * WAVE0_BELOW_MIN_LIMIT (RW)
 *
 * wave0 below min limit mode.
 * 0: output 0.
 * 1: output all bits are 1.
 * 2: output as level_min_limit0.level1_min_limit
 */
#define QEOV2_WAVE_MODE_WAVE0_BELOW_MIN_LIMIT_MASK (0x300U)
#define QEOV2_WAVE_MODE_WAVE0_BELOW_MIN_LIMIT_SHIFT (8U)
#define QEOV2_WAVE_MODE_WAVE0_BELOW_MIN_LIMIT_SET(x) (((uint32_t)(x) << QEOV2_WAVE_MODE_WAVE0_BELOW_MIN_LIMIT_SHIFT) & QEOV2_WAVE_MODE_WAVE0_BELOW_MIN_LIMIT_MASK)
#define QEOV2_WAVE_MODE_WAVE0_BELOW_MIN_LIMIT_GET(x) (((uint32_t)(x) & QEOV2_WAVE_MODE_WAVE0_BELOW_MIN_LIMIT_MASK) >> QEOV2_WAVE_MODE_WAVE0_BELOW_MIN_LIMIT_SHIFT)

/*
 * SADDLE_TYPE (RW)
 *
 * saddle type seclect;
 * 0:standard saddle.
 * 1: triple-cos saddle.
 */
#define QEOV2_WAVE_MODE_SADDLE_TYPE_MASK (0x80U)
#define QEOV2_WAVE_MODE_SADDLE_TYPE_SHIFT (7U)
#define QEOV2_WAVE_MODE_SADDLE_TYPE_SET(x) (((uint32_t)(x) << QEOV2_WAVE_MODE_SADDLE_TYPE_SHIFT) & QEOV2_WAVE_MODE_SADDLE_TYPE_MASK)
#define QEOV2_WAVE_MODE_SADDLE_TYPE_GET(x) (((uint32_t)(x) & QEOV2_WAVE_MODE_SADDLE_TYPE_MASK) >> QEOV2_WAVE_MODE_SADDLE_TYPE_SHIFT)

/*
 * ENABLE_DQ_VALID (RW)
 *
 * enable vd or vq valid to trigger analog wave calcuation
 * 0: disable.
 * 1: enable.
 */
#define QEOV2_WAVE_MODE_ENABLE_DQ_VALID_MASK (0x40U)
#define QEOV2_WAVE_MODE_ENABLE_DQ_VALID_SHIFT (6U)
#define QEOV2_WAVE_MODE_ENABLE_DQ_VALID_SET(x) (((uint32_t)(x) << QEOV2_WAVE_MODE_ENABLE_DQ_VALID_SHIFT) & QEOV2_WAVE_MODE_ENABLE_DQ_VALID_MASK)
#define QEOV2_WAVE_MODE_ENABLE_DQ_VALID_GET(x) (((uint32_t)(x) & QEOV2_WAVE_MODE_ENABLE_DQ_VALID_MASK) >> QEOV2_WAVE_MODE_ENABLE_DQ_VALID_SHIFT)

/*
 * ENABLE_POS_VALID (RW)
 *
 * enable position valid to trigger analog wave calcuation
 * 0: disable.
 * 1: enable.
 */
#define QEOV2_WAVE_MODE_ENABLE_POS_VALID_MASK (0x20U)
#define QEOV2_WAVE_MODE_ENABLE_POS_VALID_SHIFT (5U)
#define QEOV2_WAVE_MODE_ENABLE_POS_VALID_SET(x) (((uint32_t)(x) << QEOV2_WAVE_MODE_ENABLE_POS_VALID_SHIFT) & QEOV2_WAVE_MODE_ENABLE_POS_VALID_MASK)
#define QEOV2_WAVE_MODE_ENABLE_POS_VALID_GET(x) (((uint32_t)(x) & QEOV2_WAVE_MODE_ENABLE_POS_VALID_MASK) >> QEOV2_WAVE_MODE_ENABLE_POS_VALID_SHIFT)

/*
 * EN_WAVE_VD_VQ_INJECT (RW)
 *
 * wave VdVq inject enable.
 * 0: disable VdVq inject.
 * 1: enable VdVq inject.
 */
#define QEOV2_WAVE_MODE_EN_WAVE_VD_VQ_INJECT_MASK (0x10U)
#define QEOV2_WAVE_MODE_EN_WAVE_VD_VQ_INJECT_SHIFT (4U)
#define QEOV2_WAVE_MODE_EN_WAVE_VD_VQ_INJECT_SET(x) (((uint32_t)(x) << QEOV2_WAVE_MODE_EN_WAVE_VD_VQ_INJECT_SHIFT) & QEOV2_WAVE_MODE_EN_WAVE_VD_VQ_INJECT_MASK)
#define QEOV2_WAVE_MODE_EN_WAVE_VD_VQ_INJECT_GET(x) (((uint32_t)(x) & QEOV2_WAVE_MODE_EN_WAVE_VD_VQ_INJECT_MASK) >> QEOV2_WAVE_MODE_EN_WAVE_VD_VQ_INJECT_SHIFT)

/*
 * VD_VQ_SEL (RW)
 *
 * vd_vq sel ctrl:
 * 0: from CLC.
 * 1: from software.
 */
#define QEOV2_WAVE_MODE_VD_VQ_SEL_MASK (0x4U)
#define QEOV2_WAVE_MODE_VD_VQ_SEL_SHIFT (2U)
#define QEOV2_WAVE_MODE_VD_VQ_SEL_SET(x) (((uint32_t)(x) << QEOV2_WAVE_MODE_VD_VQ_SEL_SHIFT) & QEOV2_WAVE_MODE_VD_VQ_SEL_MASK)
#define QEOV2_WAVE_MODE_VD_VQ_SEL_GET(x) (((uint32_t)(x) & QEOV2_WAVE_MODE_VD_VQ_SEL_MASK) >> QEOV2_WAVE_MODE_VD_VQ_SEL_SHIFT)

/*
 * WAVES_OUTPUT_TYPE (RW)
 *
 * wave0/1/2 output mode.
 * 0: cosine wave.
 * 1: saddle wave.
 * 2. abs cosine wave.
 * 3. saw wave
 */
#define QEOV2_WAVE_MODE_WAVES_OUTPUT_TYPE_MASK (0x3U)
#define QEOV2_WAVE_MODE_WAVES_OUTPUT_TYPE_SHIFT (0U)
#define QEOV2_WAVE_MODE_WAVES_OUTPUT_TYPE_SET(x) (((uint32_t)(x) << QEOV2_WAVE_MODE_WAVES_OUTPUT_TYPE_SHIFT) & QEOV2_WAVE_MODE_WAVES_OUTPUT_TYPE_MASK)
#define QEOV2_WAVE_MODE_WAVES_OUTPUT_TYPE_GET(x) (((uint32_t)(x) & QEOV2_WAVE_MODE_WAVES_OUTPUT_TYPE_MASK) >> QEOV2_WAVE_MODE_WAVES_OUTPUT_TYPE_SHIFT)

/* Bitfield definition for register of struct WAVE: RESOLUTION */
/*
 * LINES (RW)
 *
 * wave0/1/2 resolution
 */
#define QEOV2_WAVE_RESOLUTION_LINES_MASK (0xFFFFFFFFUL)
#define QEOV2_WAVE_RESOLUTION_LINES_SHIFT (0U)
#define QEOV2_WAVE_RESOLUTION_LINES_SET(x) (((uint32_t)(x) << QEOV2_WAVE_RESOLUTION_LINES_SHIFT) & QEOV2_WAVE_RESOLUTION_LINES_MASK)
#define QEOV2_WAVE_RESOLUTION_LINES_GET(x) (((uint32_t)(x) & QEOV2_WAVE_RESOLUTION_LINES_MASK) >> QEOV2_WAVE_RESOLUTION_LINES_SHIFT)

/* Bitfield definition for register of struct WAVE: WAVE0 */
/*
 * VAL (RW)
 *
 * wave0 phase shifter value, default is 0x0. write other value will shift phase early as (cfg_value/2^32) period
 */
#define QEOV2_WAVE_PHASE_SHIFT_VAL_MASK (0xFFFFFFFFUL)
#define QEOV2_WAVE_PHASE_SHIFT_VAL_SHIFT (0U)
#define QEOV2_WAVE_PHASE_SHIFT_VAL_SET(x) (((uint32_t)(x) << QEOV2_WAVE_PHASE_SHIFT_VAL_SHIFT) & QEOV2_WAVE_PHASE_SHIFT_VAL_MASK)
#define QEOV2_WAVE_PHASE_SHIFT_VAL_GET(x) (((uint32_t)(x) & QEOV2_WAVE_PHASE_SHIFT_VAL_MASK) >> QEOV2_WAVE_PHASE_SHIFT_VAL_SHIFT)

/* Bitfield definition for register of struct WAVE: VD_INJECT */
/*
 * VD_VAL (RW)
 *
 * Vd inject value
 */
#define QEOV2_WAVE_VD_INJECT_VD_VAL_MASK (0xFFFFFFFFUL)
#define QEOV2_WAVE_VD_INJECT_VD_VAL_SHIFT (0U)
#define QEOV2_WAVE_VD_INJECT_VD_VAL_SET(x) (((uint32_t)(x) << QEOV2_WAVE_VD_INJECT_VD_VAL_SHIFT) & QEOV2_WAVE_VD_INJECT_VD_VAL_MASK)
#define QEOV2_WAVE_VD_INJECT_VD_VAL_GET(x) (((uint32_t)(x) & QEOV2_WAVE_VD_INJECT_VD_VAL_MASK) >> QEOV2_WAVE_VD_INJECT_VD_VAL_SHIFT)

