RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_qeov2_regs.h
/*
 * REVERSE_EDGE_TYPE (RW)
 *
 * pulse reverse wave，reverse edge point:
 * 0: between pulse's posedge and negedge, min period dedicated by the num line_width
 * 1: edge change point flow pulse's negedge.
 */
#define QEOV2_ABZ_MODE_REVERSE_EDGE_TYPE_MASK (0x10000000UL)
#define QEOV2_ABZ_MODE_REVERSE_EDGE_TYPE_SHIFT (28U)
#define QEOV2_ABZ_MODE_REVERSE_EDGE_TYPE_SET(x) (((uint32_t)(x) << QEOV2_ABZ_MODE_REVERSE_EDGE_TYPE_SHIFT) & QEOV2_ABZ_MODE_REVERSE_EDGE_TYPE_MASK)
#define QEOV2_ABZ_MODE_REVERSE_EDGE_TYPE_GET(x) (((uint32_t)(x) & QEOV2_ABZ_MODE_REVERSE_EDGE_TYPE_MASK) >> QEOV2_ABZ_MODE_REVERSE_EDGE_TYPE_SHIFT)

/*
 * POSITION_SYNC_MODE (RW)
 *
 * position sync mode:
 * 0: only sync integer line part into qeo own position.
 * 1: sync integer and fraction part into qeo own position.
 */
#define QEOV2_ABZ_MODE_POSITION_SYNC_MODE_MASK (0x8000000UL)
#define QEOV2_ABZ_MODE_POSITION_SYNC_MODE_SHIFT (27U)
#define QEOV2_ABZ_MODE_POSITION_SYNC_MODE_SET(x) (((uint32_t)(x) << QEOV2_ABZ_MODE_POSITION_SYNC_MODE_SHIFT) & QEOV2_ABZ_MODE_POSITION_SYNC_MODE_MASK)
#define QEOV2_ABZ_MODE_POSITION_SYNC_MODE_GET(x) (((uint32_t)(x) & QEOV2_ABZ_MODE_POSITION_SYNC_MODE_MASK) >> QEOV2_ABZ_MODE_POSITION_SYNC_MODE_SHIFT)

/*
 * EN_WDOG (RW)
 *
 * enable abz wdog:
 * 0: disable abz wdog.
 * 1: enable abz wdog.
 */
#define QEOV2_ABZ_MODE_EN_WDOG_MASK (0x1000000UL)
#define QEOV2_ABZ_MODE_EN_WDOG_SHIFT (24U)
#define QEOV2_ABZ_MODE_EN_WDOG_SET(x) (((uint32_t)(x) << QEOV2_ABZ_MODE_EN_WDOG_SHIFT) & QEOV2_ABZ_MODE_EN_WDOG_MASK)
#define QEOV2_ABZ_MODE_EN_WDOG_GET(x) (((uint32_t)(x) & QEOV2_ABZ_MODE_EN_WDOG_MASK) >> QEOV2_ABZ_MODE_EN_WDOG_SHIFT)

/*
 * Z_POLARITY (RW)
 *
 * wave_z polarity.
 * 0: normal output.
 * 1: invert normal output
 */
#define QEOV2_ABZ_MODE_Z_POLARITY_MASK (0x100000UL)
#define QEOV2_ABZ_MODE_Z_POLARITY_SHIFT (20U)
#define QEOV2_ABZ_MODE_Z_POLARITY_SET(x) (((uint32_t)(x) << QEOV2_ABZ_MODE_Z_POLARITY_SHIFT) & QEOV2_ABZ_MODE_Z_POLARITY_MASK)
#define QEOV2_ABZ_MODE_Z_POLARITY_GET(x) (((uint32_t)(x) & QEOV2_ABZ_MODE_Z_POLARITY_MASK) >> QEOV2_ABZ_MODE_Z_POLARITY_SHIFT)

/*
 * B_POLARITY (RW)
 *
 * wave_b polarity.
 * 0: normal output.
 * 1: invert normal output
 */
#define QEOV2_ABZ_MODE_B_POLARITY_MASK (0x10000UL)
#define QEOV2_ABZ_MODE_B_POLARITY_SHIFT (16U)
#define QEOV2_ABZ_MODE_B_POLARITY_SET(x) (((uint32_t)(x) << QEOV2_ABZ_MODE_B_POLARITY_SHIFT) & QEOV2_ABZ_MODE_B_POLARITY_MASK)
#define QEOV2_ABZ_MODE_B_POLARITY_GET(x) (((uint32_t)(x) & QEOV2_ABZ_MODE_B_POLARITY_MASK) >> QEOV2_ABZ_MODE_B_POLARITY_SHIFT)

/*
 * A_POLARITY (RW)
 *
 * wave_a polarity.
 * 0: normal output.
 * 1: invert normal output
 */
#define QEOV2_ABZ_MODE_A_POLARITY_MASK (0x1000U)
#define QEOV2_ABZ_MODE_A_POLARITY_SHIFT (12U)
#define QEOV2_ABZ_MODE_A_POLARITY_SET(x) (((uint32_t)(x) << QEOV2_ABZ_MODE_A_POLARITY_SHIFT) & QEOV2_ABZ_MODE_A_POLARITY_MASK)
#define QEOV2_ABZ_MODE_A_POLARITY_GET(x) (((uint32_t)(x) & QEOV2_ABZ_MODE_A_POLARITY_MASK) >> QEOV2_ABZ_MODE_A_POLARITY_SHIFT)

/*
 * Z_TYPE (RW)
 *
 * wave_z type:
 * 0: zero pulse type, start and end line number decided by z_start、z_end and z_offset.
 * 1: zero pulse type, z output start to high when position= z_start, and mantain numbers of 1/4 line cfg in z_pulse_width register
 * 2: reserved
 * 3: wave_z output as tree-phase wave same as wave_a/wave_b
 */
#define QEOV2_ABZ_MODE_Z_TYPE_MASK (0x300U)
#define QEOV2_ABZ_MODE_Z_TYPE_SHIFT (8U)
#define QEOV2_ABZ_MODE_Z_TYPE_SET(x) (((uint32_t)(x) << QEOV2_ABZ_MODE_Z_TYPE_SHIFT) & QEOV2_ABZ_MODE_Z_TYPE_MASK)
#define QEOV2_ABZ_MODE_Z_TYPE_GET(x) (((uint32_t)(x) & QEOV2_ABZ_MODE_Z_TYPE_MASK) >> QEOV2_ABZ_MODE_Z_TYPE_SHIFT)

/*
 * B_TYPE (RW)
 *
 * wave_b type:
 * 0: Two-phase orthogonality wave_b.
 * 1: reverse wave of pulse/reverse type.
 * 2: down wave of up/down type.
 * 3: Three-phase orthogonality wave_b.
 */
#define QEOV2_ABZ_MODE_B_TYPE_MASK (0x30U)
#define QEOV2_ABZ_MODE_B_TYPE_SHIFT (4U)
#define QEOV2_ABZ_MODE_B_TYPE_SET(x) (((uint32_t)(x) << QEOV2_ABZ_MODE_B_TYPE_SHIFT) & QEOV2_ABZ_MODE_B_TYPE_MASK)
#define QEOV2_ABZ_MODE_B_TYPE_GET(x) (((uint32_t)(x) & QEOV2_ABZ_MODE_B_TYPE_MASK) >> QEOV2_ABZ_MODE_B_TYPE_SHIFT)

/*
 * A_TYPE (RW)
 *
 * wave_a type:
 * 0: Two-phase orthogonality wave_a.
 * 1: pulse wave of pulse/reverse type.
 * 2: up wave of up/down type.
 * 3: Three-phase orthogonality wave_a.
 */
#define QEOV2_ABZ_MODE_A_TYPE_MASK (0x3U)
#define QEOV2_ABZ_MODE_A_TYPE_SHIFT (0U)
#define QEOV2_ABZ_MODE_A_TYPE_SET(x) (((uint32_t)(x) << QEOV2_ABZ_MODE_A_TYPE_SHIFT) & QEOV2_ABZ_MODE_A_TYPE_MASK)
#define QEOV2_ABZ_MODE_A_TYPE_GET(x) (((uint32_t)(x) & QEOV2_ABZ_MODE_A_TYPE_MASK) >> QEOV2_ABZ_MODE_A_TYPE_SHIFT)

/* Bitfield definition for register of struct ABZ: RESOLUTION */
/*
 * LINES (RW)
 *
 * wave_a/b/z resolution
 */
#define QEOV2_ABZ_RESOLUTION_LINES_MASK (0xFFFFFFFFUL)
#define QEOV2_ABZ_RESOLUTION_LINES_SHIFT (0U)
#define QEOV2_ABZ_RESOLUTION_LINES_SET(x) (((uint32_t)(x) << QEOV2_ABZ_RESOLUTION_LINES_SHIFT) & QEOV2_ABZ_RESOLUTION_LINES_MASK)
#define QEOV2_ABZ_RESOLUTION_LINES_GET(x) (((uint32_t)(x) & QEOV2_ABZ_RESOLUTION_LINES_MASK) >> QEOV2_ABZ_RESOLUTION_LINES_SHIFT)

/* Bitfield definition for register of struct ABZ: A */
/*
 * VAL (RW)
 *
 * wave_a phase shifter value, default is 0x0. write other value will shift phase early as (cfg_value/2^32) period.
 */
#define QEOV2_ABZ_PHASE_SHIFT_VAL_MASK (0xFFFFFFFFUL)
#define QEOV2_ABZ_PHASE_SHIFT_VAL_SHIFT (0U)
#define QEOV2_ABZ_PHASE_SHIFT_VAL_SET(x) (((uint32_t)(x) << QEOV2_ABZ_PHASE_SHIFT_VAL_SHIFT) & QEOV2_ABZ_PHASE_SHIFT_VAL_MASK)
#define QEOV2_ABZ_PHASE_SHIFT_VAL_GET(x) (((uint32_t)(x) & QEOV2_ABZ_PHASE_SHIFT_VAL_MASK) >> QEOV2_ABZ_PHASE_SHIFT_VAL_SHIFT)

/* Bitfield definition for register of struct ABZ: LINE_WIDTH */
/*
 * LINE (RW)
 *
 * the num of system clk by 1/4 period when using as Two-phase orthogonality.
 */
#define QEOV2_ABZ_LINE_WIDTH_LINE_MASK (0xFFFFFFFFUL)
#define QEOV2_ABZ_LINE_WIDTH_LINE_SHIFT (0U)
#define QEOV2_ABZ_LINE_WIDTH_LINE_SET(x) (((uint32_t)(x) << QEOV2_ABZ_LINE_WIDTH_LINE_SHIFT) & QEOV2_ABZ_LINE_WIDTH_LINE_MASK)
#define QEOV2_ABZ_LINE_WIDTH_LINE_GET(x) (((uint32_t)(x) & QEOV2_ABZ_LINE_WIDTH_LINE_MASK) >> QEOV2_ABZ_LINE_WIDTH_LINE_SHIFT)

/* Bitfield definition for register of struct ABZ: WDOG_WIDTH */
/*
 * WIDTH (RW)
 *
 * wave will step 1/4 line to reminder user QEO still in controlled if QEO has no any toggle after the num of wdog_width sys clk.
 */
#define QEOV2_ABZ_WDOG_WIDTH_WIDTH_MASK (0xFFFFFFFFUL)
#define QEOV2_ABZ_WDOG_WIDTH_WIDTH_SHIFT (0U)
#define QEOV2_ABZ_WDOG_WIDTH_WIDTH_SET(x) (((uint32_t)(x) << QEOV2_ABZ_WDOG_WIDTH_WIDTH_SHIFT) & QEOV2_ABZ_WDOG_WIDTH_WIDTH_MASK)
#define QEOV2_ABZ_WDOG_WIDTH_WIDTH_GET(x) (((uint32_t)(x) & QEOV2_ABZ_WDOG_WIDTH_WIDTH_MASK) >> QEOV2_ABZ_WDOG_WIDTH_WIDTH_SHIFT)

