RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_qeov2_regs.h
/* Bitfield definition for register of struct ABZ: POSTION_SYNC */
/*
 * POSTION (WO)
 *
 * load next valid postion into  abz owned postion.  always read 0
 * 0: sync abz owned postion with next valid postion.
 * 1: not sync.
 */
#define QEOV2_ABZ_POSTION_SYNC_POSTION_MASK (0x1U)
#define QEOV2_ABZ_POSTION_SYNC_POSTION_SHIFT (0U)
#define QEOV2_ABZ_POSTION_SYNC_POSTION_SET(x) (((uint32_t)(x) << QEOV2_ABZ_POSTION_SYNC_POSTION_SHIFT) & QEOV2_ABZ_POSTION_SYNC_POSTION_MASK)
#define QEOV2_ABZ_POSTION_SYNC_POSTION_GET(x) (((uint32_t)(x) & QEOV2_ABZ_POSTION_SYNC_POSTION_MASK) >> QEOV2_ABZ_POSTION_SYNC_POSTION_SHIFT)

/* Bitfield definition for register of struct ABZ: OVERALL_OFFSET */
/*
 * VAL (RW)
 *
 * abz position overall offset, it affects abz position before resolution convert
 */
#define QEOV2_ABZ_OVERALL_OFFSET_VAL_MASK (0xFFFFFFFFUL)
#define QEOV2_ABZ_OVERALL_OFFSET_VAL_SHIFT (0U)
#define QEOV2_ABZ_OVERALL_OFFSET_VAL_SET(x) (((uint32_t)(x) << QEOV2_ABZ_OVERALL_OFFSET_VAL_SHIFT) & QEOV2_ABZ_OVERALL_OFFSET_VAL_MASK)
#define QEOV2_ABZ_OVERALL_OFFSET_VAL_GET(x) (((uint32_t)(x) & QEOV2_ABZ_OVERALL_OFFSET_VAL_MASK) >> QEOV2_ABZ_OVERALL_OFFSET_VAL_SHIFT)

/* Bitfield definition for register of struct ABZ: Z_START */
/*
 * Z_START (RW)
 *
 * number of Z start line
 */
#define QEOV2_ABZ_Z_START_Z_START_MASK (0xFFFFFFFFUL)
#define QEOV2_ABZ_Z_START_Z_START_SHIFT (0U)
#define QEOV2_ABZ_Z_START_Z_START_SET(x) (((uint32_t)(x) << QEOV2_ABZ_Z_START_Z_START_SHIFT) & QEOV2_ABZ_Z_START_Z_START_MASK)
#define QEOV2_ABZ_Z_START_Z_START_GET(x) (((uint32_t)(x) & QEOV2_ABZ_Z_START_Z_START_MASK) >> QEOV2_ABZ_Z_START_Z_START_SHIFT)

/* Bitfield definition for register of struct ABZ: Z_END */
/*
 * Z_END (RW)
 *
 * number of Z end line
 */
#define QEOV2_ABZ_Z_END_Z_END_MASK (0xFFFFFFFFUL)
#define QEOV2_ABZ_Z_END_Z_END_SHIFT (0U)
#define QEOV2_ABZ_Z_END_Z_END_SET(x) (((uint32_t)(x) << QEOV2_ABZ_Z_END_Z_END_SHIFT) & QEOV2_ABZ_Z_END_Z_END_MASK)
#define QEOV2_ABZ_Z_END_Z_END_GET(x) (((uint32_t)(x) & QEOV2_ABZ_Z_END_Z_END_MASK) >> QEOV2_ABZ_Z_END_Z_END_SHIFT)

/* Bitfield definition for register of struct ABZ: Z_OFFSET */
/*
 * Z_END_OFFSET (RW)
 *
 * number of Z end 1/4 line
 */
#define QEOV2_ABZ_Z_OFFSET_Z_END_OFFSET_MASK (0x300U)
#define QEOV2_ABZ_Z_OFFSET_Z_END_OFFSET_SHIFT (8U)
#define QEOV2_ABZ_Z_OFFSET_Z_END_OFFSET_SET(x) (((uint32_t)(x) << QEOV2_ABZ_Z_OFFSET_Z_END_OFFSET_SHIFT) & QEOV2_ABZ_Z_OFFSET_Z_END_OFFSET_MASK)
#define QEOV2_ABZ_Z_OFFSET_Z_END_OFFSET_GET(x) (((uint32_t)(x) & QEOV2_ABZ_Z_OFFSET_Z_END_OFFSET_MASK) >> QEOV2_ABZ_Z_OFFSET_Z_END_OFFSET_SHIFT)

/*
 * Z_START_OFFSET (RW)
 *
 * number of Z start 1/4 line
 */
#define QEOV2_ABZ_Z_OFFSET_Z_START_OFFSET_MASK (0x30U)
#define QEOV2_ABZ_Z_OFFSET_Z_START_OFFSET_SHIFT (4U)
#define QEOV2_ABZ_Z_OFFSET_Z_START_OFFSET_SET(x) (((uint32_t)(x) << QEOV2_ABZ_Z_OFFSET_Z_START_OFFSET_SHIFT) & QEOV2_ABZ_Z_OFFSET_Z_START_OFFSET_MASK)
#define QEOV2_ABZ_Z_OFFSET_Z_START_OFFSET_GET(x) (((uint32_t)(x) & QEOV2_ABZ_Z_OFFSET_Z_START_OFFSET_MASK) >> QEOV2_ABZ_Z_OFFSET_Z_START_OFFSET_SHIFT)

/* Bitfield definition for register of struct ABZ: Z_PULSE_WIDTH */
/*
 * VAL (RW)
 *
 * number of z_pulse_width
 */
#define QEOV2_ABZ_Z_PULSE_WIDTH_VAL_MASK (0xFFFFFFFFUL)
#define QEOV2_ABZ_Z_PULSE_WIDTH_VAL_SHIFT (0U)
#define QEOV2_ABZ_Z_PULSE_WIDTH_VAL_SET(x) (((uint32_t)(x) << QEOV2_ABZ_Z_PULSE_WIDTH_VAL_SHIFT) & QEOV2_ABZ_Z_PULSE_WIDTH_VAL_MASK)
#define QEOV2_ABZ_Z_PULSE_WIDTH_VAL_GET(x) (((uint32_t)(x) & QEOV2_ABZ_Z_PULSE_WIDTH_VAL_MASK) >> QEOV2_ABZ_Z_PULSE_WIDTH_VAL_SHIFT)

/* Bitfield definition for register of struct PWM: MODE */
/*
 * PWM7_SAFETY (RW)
 *
 * PWM safety mode phase table
 */
#define QEOV2_PWM_MODE_PWM7_SAFETY_MASK (0xC0000000UL)
#define QEOV2_PWM_MODE_PWM7_SAFETY_SHIFT (30U)
#define QEOV2_PWM_MODE_PWM7_SAFETY_SET(x) (((uint32_t)(x) << QEOV2_PWM_MODE_PWM7_SAFETY_SHIFT) & QEOV2_PWM_MODE_PWM7_SAFETY_MASK)
#define QEOV2_PWM_MODE_PWM7_SAFETY_GET(x) (((uint32_t)(x) & QEOV2_PWM_MODE_PWM7_SAFETY_MASK) >> QEOV2_PWM_MODE_PWM7_SAFETY_SHIFT)

/*
 * PWM6_SAFETY (RW)
 *
 * PWM safety mode phase table
 */
#define QEOV2_PWM_MODE_PWM6_SAFETY_MASK (0x30000000UL)
#define QEOV2_PWM_MODE_PWM6_SAFETY_SHIFT (28U)
#define QEOV2_PWM_MODE_PWM6_SAFETY_SET(x) (((uint32_t)(x) << QEOV2_PWM_MODE_PWM6_SAFETY_SHIFT) & QEOV2_PWM_MODE_PWM6_SAFETY_MASK)
#define QEOV2_PWM_MODE_PWM6_SAFETY_GET(x) (((uint32_t)(x) & QEOV2_PWM_MODE_PWM6_SAFETY_MASK) >> QEOV2_PWM_MODE_PWM6_SAFETY_SHIFT)

/*
 * PWM5_SAFETY (RW)
 *
 * PWM safety mode phase table
 */
#define QEOV2_PWM_MODE_PWM5_SAFETY_MASK (0xC000000UL)
#define QEOV2_PWM_MODE_PWM5_SAFETY_SHIFT (26U)
#define QEOV2_PWM_MODE_PWM5_SAFETY_SET(x) (((uint32_t)(x) << QEOV2_PWM_MODE_PWM5_SAFETY_SHIFT) & QEOV2_PWM_MODE_PWM5_SAFETY_MASK)
#define QEOV2_PWM_MODE_PWM5_SAFETY_GET(x) (((uint32_t)(x) & QEOV2_PWM_MODE_PWM5_SAFETY_MASK) >> QEOV2_PWM_MODE_PWM5_SAFETY_SHIFT)

/*
 * PWM4_SAFETY (RW)
 *
 * PWM safety mode phase table
 */
#define QEOV2_PWM_MODE_PWM4_SAFETY_MASK (0x3000000UL)
#define QEOV2_PWM_MODE_PWM4_SAFETY_SHIFT (24U)
#define QEOV2_PWM_MODE_PWM4_SAFETY_SET(x) (((uint32_t)(x) << QEOV2_PWM_MODE_PWM4_SAFETY_SHIFT) & QEOV2_PWM_MODE_PWM4_SAFETY_MASK)
#define QEOV2_PWM_MODE_PWM4_SAFETY_GET(x) (((uint32_t)(x) & QEOV2_PWM_MODE_PWM4_SAFETY_MASK) >> QEOV2_PWM_MODE_PWM4_SAFETY_SHIFT)

/*
 * PWM3_SAFETY (RW)
 *
 * PWM safety mode phase table
 */
#define QEOV2_PWM_MODE_PWM3_SAFETY_MASK (0xC00000UL)
#define QEOV2_PWM_MODE_PWM3_SAFETY_SHIFT (22U)
#define QEOV2_PWM_MODE_PWM3_SAFETY_SET(x) (((uint32_t)(x) << QEOV2_PWM_MODE_PWM3_SAFETY_SHIFT) & QEOV2_PWM_MODE_PWM3_SAFETY_MASK)
#define QEOV2_PWM_MODE_PWM3_SAFETY_GET(x) (((uint32_t)(x) & QEOV2_PWM_MODE_PWM3_SAFETY_MASK) >> QEOV2_PWM_MODE_PWM3_SAFETY_SHIFT)

/*
 * PWM2_SAFETY (RW)
 *
 * PWM safety mode phase table
 */
#define QEOV2_PWM_MODE_PWM2_SAFETY_MASK (0x300000UL)
#define QEOV2_PWM_MODE_PWM2_SAFETY_SHIFT (20U)
#define QEOV2_PWM_MODE_PWM2_SAFETY_SET(x) (((uint32_t)(x) << QEOV2_PWM_MODE_PWM2_SAFETY_SHIFT) & QEOV2_PWM_MODE_PWM2_SAFETY_MASK)
#define QEOV2_PWM_MODE_PWM2_SAFETY_GET(x) (((uint32_t)(x) & QEOV2_PWM_MODE_PWM2_SAFETY_MASK) >> QEOV2_PWM_MODE_PWM2_SAFETY_SHIFT)

